{
    "aqua": {
        "5": "Player chose Run For It in Rusturf.",
        "10": "Player brought goods to aqua and now needs to get 3 badges to contninue.",
        "25": "Received instructions to go capture and question Stern",
        "28": "Player arrived at Museum. Defeat Devon guard to continue.",
        "30": "Player defeated Devon guard, go upstairs.",
        "40": "Player is _attempting_ to fight Steven.",
        "45": "Player failed to defeat steven, black out to Aqua Office.",
        "55": "Player rested in Aqua's office. To get the next mission, get 5 badges total.",
        "60": "Player must go to Meteor Falls.",
        "65": "Player is making choice between standard and Shelly aqua lines.",
        "70": "Player chose Romance tree of Aqua. Go to Mt. Chimney.",
        "72": "Player chose non-romance tree of aqua. Return to Shelly in Aqua Office.",
        "80": "Player must obtain 6 total badges to continue storyline.",
        "82": "Player obtained 6 badges. Go to Mt. Pyre.",
        "88": "Player finished scene in Mt. Pyre Exterior, go into the summit area.",
        "92": "Matt comes to back up Player in mini boss fight.",
        "94": "Player defeated Courtney, Maxie coming in",
        "96": "Player defeated Maxie. Watch cinematic.",
        "100": "Mt. Pyre Summit scene over. Go to slateport Harbor.",
        "102": "Player entered Slateport Harbor and cannot leave until they finish the cinematic there.",
        "108": "Player finished Harbor. Go to Mossdeep City and meet with Matt up on the hill.",
        "130": "Player finished the Aqua Archie side cinematic, player should go to route 130 and CAPTURE Kyogre. If Kyogre is not captured, then player will have to complete the elite four and become champion to respawn kyogre at route 130 and continue the quest.",
        "150": "Player captured Kyogre. Warping to Mossdeep for conclusion.",
        "160": "Player finished Aqua **Neutral** line. Archie and Shelly gone, Matt arrested. GG.",
        "81": "Player defeated Maxie at Mt. Chimney. Player should take the Star Piece to the jeweler in the department store, or they will get the neutral aqua line and will have to obtain 6 badges to continue neutral line.",
        "85": "Player chose to have the neclace made, thus cementing Shelly Romance line.",
        "91": "Player had necklace made, obtain a total of 6 badges to continue with the Shelly line.",
        "93": "Shelly wants to meet player inside first level of Magma base. She will show up in the hallway on the left.",
        "95": "Shelly is following player until they clear out the Magma base up to the last room and must face Maxie and Courtney. Player cannot leave until this is done.",
        "105": "Player must return to the Aqua Office with Shelly.",
        "107": "Player returned to the aqua office from jagged pass. Player should see shelly for rewards.",
        "111": "Player must now go to the Slateport Shipyard and confront Stern. Player will need to clear out the bottom floor and go to second floor.",
        "117": "Player received the call from shelly to meet near weather institute. Go to route 119's bridge.",
        "123": "Player met with shelly on route 119, Player should get to 7 badges. ",
        "125": "Player received the call to go to the aqua hideout, and get to the submarine at the bottom of B2F",
        "148": "Player is now in front of Kyogre under water (ignore the corrupted palette for player sprite). Player must capture Kyogre to continue aqua. If player fails to capture Kyogre, they must become champion for it to respawn to try again.",
        "157": "Player captured Kyogre. Return to the Aqua Office and meet with Shelly.",
        "161": "Player completed the Aqua **Shelly** line, and watched the first night cinematic. Return and stay with Shelly again to gain her as a partner permanently."
    },
    "magma": {
        "100": "Player chose Magma in Rusturf tunnel. Take the goods to Shelly in the Aqua Office in lilycove (NOT THE CAVE).",
        "105": "Player should go to Mr Briney's cottage west of petalburg.",
        "115": "Player was ordered to meet Blaise in granite cave. Go find him in the base floor, disguised as a Kindler.",
        "120": "Player needs to locate the other everstone in Granite Cave.",
        "130": "Player found second everstone and faced Steven. Player must now obtain a total of 3 badges to continue the quest. Once obtained, go to Route 111 north of the desert. Approach from the north side using the stairs.",
        "160": "Player must now obtain 8000 grams of volcanic ash. Once collected, return here to blaise to continue.",
        "165": "Player collected the ash. Go to Lilycove to begin sabotage. Speak to the Magma grunt in the middle of the coastline.",
        "170": "Player spoke to first grunt. Go to north grunt now to continue.",
        "175": "Player spoke to top grunt, go to bottom grunt to finish the sabotage.",
        "180": "Player poisoned the cove waters. Go to the harbor for the next event.",
        "200": "Player finished the event in the harbor. Go to route 111 for the second meeting with magma leaders. Player is now banned from lilycove.",
        "210": "Player met with Maxie and got a promotion. Player needs to obtain a total of 6 badges to continue. Once obtained, go north of Oldale town for next event.",
        "225": "Player met with grunts organizing a mart heist. head into Oldale.",
        "230": "Player should now defeat the guard in front of the mart.",
        "245": "Heist was botched, alarm was set off, flee through Petalburg.",
        "250": "Player made it to Petalburg. Keep heading west towards the cottage.",
        "260": "Player was nearly captured by Devon Enforcers. Courtney saved your ass. you're on slateport beach.",
        "275": "Player recieved reward on beach, head to the middle exit of Rusturf tunnel to meet up with magma leaders again.",
        "300": "Player survived meeting with magma leaders again. Go to route 112 near the entrance to the cable car to meet up with Blaise. After meeting up with blaise you must Clear ALL trainers in and near jagged pass.",
        "301": "Player cleared out all the civilians. Head into the Magma Base and find Maxie",
        "302": "Go talk to Maxie deeper in Magma Hideout 4f.",
        "305": "Follow maxie around the bend to the base of the volcano.",
        "315": "Player needs to clear out ALL of the aqua grunts with Courtney.",
        "320": "Player finished clearing out aqua. Head out to Jagged Pass to meet with Blaise.",
        "325": "Player met with Blaise outside. Being teleported in to watch the Maxie sermon.",
        "350": "Player must obtain a total of 7 badges to continue the magma quest.",
        "400": "Return to B4F of magma base and speak with Maxie.",
        "405": "Player met with maxie in B4F again. This is the only chance you have to romance courtney. To do so, go into Fiery Path and talk to Courtney there. Otherwise, if you do not want to romance courtney, head to Seafloor Cavern. You must fight and defeat Archie. Doing so lets you choose which branch of Magma you want to do. Answer YES to his question to go after Maxie, or answer NO to do maxie's bidding.",
        "450": "Player chose to follow Maxie. Return to Magma Base 4f. You will face groudon. If you chose to romance courtney, she will give you a master ball.",
        "550": "Player chose to backstab Maxie. Starting a cinematic.",
        "598": "Player finished **Magma Main** and did not romance courtney.(Neutral End)",
        "599": "Player finished **Magma Main** and romanced courtney.(Good End)",
        "555": "Player is attempting to oust Maxie. Currently the player needs to go face Groudon and Capture or Defeat it. After doing so, return to land on the left.",
        "560": "Maxie escaped. Go find him in Route 114. (If you chose to romance courtney, she will follow you for the rest of the quest.)",
        "570": "Player found Maxie in route 114, He escaped to Littleroot Town. Find him in the Lab.",
        "575": "Player found maxie in the lab. Head to the Treasure Hunter's house in Route 124. If you did not romance Courtney, the quest ends here.",
        "597": "Player finished the **Magma Alt** quest and did not romance Courtney.(Bad End)",
        "580": "Player needs to go to the cave just northwest of the treasure hunter's house.",
        "596": "Player completed the **Magma Alt** quest and romanced courtney. (Best End)"
    },
    "devon": {
        "5": "Player chose devon quest. Player should go to Devon Corp.",
        "15": "Player met president. Go deliver letter to steven in dewford cave.",
        "16": "Player delivered letter, go to the oceanic museum to meet stern.",
        "17": "Player is on second floor to speak with Stern.",
        "18": "Player spoke with stern and protected him from archie. Return to Devon.",
        "19": "Player completed Mr. Stone's tasks. Talk to him again to get mission to go to Meteor Falls.",
        "20": "Player completed Meteor Falls. Go see Cozmo at his house in Fallarbor.",
        "21": "Player is tasked with going to Mt. Chimney and retreiving the meteorite.",
        "22": "Player got the meteorite. Return to Cozmo.",
        "23": "Player is tasked with going to the aqua hideout and recovering the Radiation Detector.",
        "24": "Player obtained the Radiation Detector. Return to Cozmo.",
        "25": "Player finished all of Cozmo's missions and should return to the President.",
        "35": "Player is meeting devon employees. Talk to all of them to continue.",
        "40": "Player can now leave 2f to go to 1f. (Right side staircase.) ",
        "45": "Player needs to go find Ms. Ito north of Rustburo.",
        "60": "Player completed the **DEVON CORPORATE** questline. Return after being champion to get access to Rayquaza.",
		"102": "Player was just transported to the Weather Institute. Clear out the enemy team and defeat shelly above.",
		"103": "Player should be heading to the bottom of the Desert to work with Castform.",
		"104": "Player finished working with Castform in the desert. Return to the weather institute.",
		"105": "Player returned to the institute. It was recommended to ask the space center for help. Go there.",
		"106": "Player should clear out the magma goons on the bottom floor. Then go upstairs and deal with Maxie.",
		"107": "Player cleared out magma and met the mysterious talking pokemon, who challenged them. Go to Victory Road. There's a hidden cave at the top left that should be open during this quest.",
		"108": "Player faced the mysterious talking pokemon in Victory Road. You must become champion to continue. Once you are, head to the northeast area of the Safari Zone. There will be another cave at the top left.",
		"115": "Player finished devon scientist and the mysterious pokemon joined their party.",
		"111": "Player defeated the mysterious pokemon, but needs to make space in their party and return."
	}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}