{
    "aqua": {
        "5": "Player chose Run For It in Rusturf.",
        "10": "Player brought goods to aqua and now needs to get 3 badges to contninue.",
        "25": "Received instructions to go capture and question Stern",
        "28": "Player arrived at Museum. Defeat Devon guard to continue.",
        "30": "Player defeated Devon guard, go upstairs.",
        "40": "Player is _attempting_ to fight Steven.",
        "45": "Player failed to defeat steven, black out to Aqua Office.",
        "55": "Player rested in Aqua's office. To get the next mission, get 5 badges total.",
        "60": "Player must go to Meteor Falls.",
        "65": "Player is making choice between standard and Shelly aqua lines.",
        "70": "Player chose Romance tree of Aqua. Go to Mt. Chimney.",
        "72": "Player chose non-romance tree of aqua. Return to Shelly in Aqua Office.",
        "80": "Player must obtain 6 total badges to continue storyline.",
        "82": "Player obtained 6 badges. Go to Mt. Pyre.",
        "88": "Player finished scene in Mt. Pyre Exterior, go into the summit area.",
        "92": "Matt comes to back up Player in mini boss fight.",
        "94": "Player defeated Courtney, Maxie coming in",
        "96": "Player defeated Maxie. Watch cinematic.",
        "100": "Mt. Pyre Summit scene over. Go to slateport Harbor.",
        "102": "Player entered Slateport Harbor and cannot leave until they finish the cinematic there.",
        "108": "Player finished Harbor. Go to Mossdeep City and meet with Matt up on the hill.",
        "130": "Player finished the Aqua Archie side cinematic, player should go to route 130 and CAPTURE Kyogre. If Kyogre is not captured, then player will have to complete the elite four and become champion to respawn kyogre at route 130 and continue the quest.",
        "150": "Player captured Kyogre. Warping to Mossdeep for conclusion.",
        "160": "Player finished Aqua **Neutral** line. Archie and Shelly gone, Matt arrested. GG.",
        "81": "Player defeated Maxie at Mt. Chimney. Player should take the Star Piece to the jeweler in the department store, or they will get the neutral aqua line and will have to obtain 6 badges to continue neutral line.",
        "85": "Player chose to have the neclace made, thus cementing Shelly Romance line.",
        "91": "Player had necklace made, obtain a total of 6 badges to continue with the Shelly line.",
        "93": "Shelly wants to meet player inside first level of Magma base. She will show up in the hallway on the left.",
        "95": "Shelly is following player until they clear out the Magma base up to the last room and must face Maxie and Courtney. Player cannot leave until this is done.",
        "105": "Player must return to the Aqua Office with Shelly.",
        "107": "Player returned to the aqua office from jagged pass. Player should see shelly for rewards.",
        "111": "Player must now go to the Slateport Shipyard and confront Stern. Player will need to clear out the bottom floor and go to second floor.",
        "117": "Player received the call from shelly to meet near weather institute. Go to route 119's bridge.",
        "123": "Player met with shelly on route 119, Player should get to 7 badges. ",
        "125": "Player received the call to go to the aqua hideout, and get to the submarine at the bottom of B2F",
        "148": "Player is now in front of Kyogre under water (ignore the corrupted palette for player sprite). Player must capture Kyogre to continue aqua. If player fails to capture Kyogre, they must become champion for it to respawn to try again.",
        "157": "Player captured Kyogre. Return to the Aqua Office and meet with Shelly.",
        "161": "Player completed the Aqua **Shelly** line, and watched the first night cinematic. Return and stay with Shelly again to gain her as a partner permanently."
    },
    "magma": {
        "1": "this is stage 1",
        "2": "this is stage 2",
        "999": "this is stage 999",
        "69": "this is a _nice_ stage"
    },
    "rival": {
        "1": "this is stage 1",
        "2": "this is stage 2",
        "999": "this is stage 999",
        "69": "this is a _nice_ stage"
    }
}