#include "global.h"
#include "dexnav.h"
#include "data.h"
#include "pokemon.h"
#include "sprite.h"
#include "battle_setup.h"
#include "event_data.h"
#include "field_effect.h"
#include "window.h"
#include "party_menu.h"
#include "event_scripts.h"
#include "bg.h"
#include "text.h"
#include "field_message_box.h"
#include "pokedex.h"
#include "palette.h"
#include "random.h"
#include "main.h"
#include "graphics.h"
#include "overworld.h"
#include "task.h"
#include "malloc.h"
#include "fieldmap.h"
#include "pokemon_icon.h"
#include "gpu_regs.h"
#include "string_util.h"
#include "field_player_avatar.h"
#include "field_effect_helpers.h"
#include "event_object_movement.h"
#include "script.h"
#include "start_menu.h"
#include "battle_main.h"
#include "wild_encounter.h"
#include "metatile_behavior.h"
#include "field_screen_effect.h"
#include "daycare.h"
#include "menu.h"
#include "m4a.h"
#include "sound.h"
#include "decompress.h"
#include "region_map.h"
#include "constants/map_types.h"
#include "constants/species.h"
#include "constants/maps.h"
#include "constants/field_effects.h"
#include "constants/items.h"
#include "constants/songs.h"
#include "constants/abilities.h"
#include "gba/m4a_internal.h"

// Defines
enum WindowIds
{
    WINDOW_SPECIES,
    WINDOW_SEARCH_LEVEL,
    WINDOW_LEVEL_BONUS,
    WINDOW_HIDDEN_ABILITY,
    WINDOW_REPLY_TEXT,
    WINDOW_WATER,
    WINDOW_LAND,
    WINDOW_MAP_NAME,
    WINDOW_COUNT,
};

enum Statuses
{
    STATUS_INVALID_SEARCH,
    STATUS_CHOOSE_MON,
    STATUS_LOCKED,
    STATUS_NO_DATA,
    STATUS_INCORRECT_AREA,
};

enum PokeToolsMenuItems
{
    POKETOOLS_ACTION_POKEDEX,
    POKETOOLS_ACTION_DEXNAV,
};

#define IS_NEWER_UNOWN_LETTER(species) (species >= SPECIES_UNOWN_B && species <= SPECIES_UNOWN_QMARK)

struct DexnavSearch
{
    /*0x00*/ u16 species;
    /*0x02*/ u16 moveId[MAX_MON_MOVES];
    /*0x0A*/ u16 heldItem;
    /*0x0C*/ u8 ability;
    /*0x0D*/ u8 potential;
    /*0x0E*/ u8 searchLevel;
    /*0x0F*/ u8 monLevel;
    /*0x10*/ u8 moveNameLength;
    /*0x11*/ u8 proximity;
    /*0x12*/ u8 environment;
	/*0x13*/ u8 unownLetter;
    /*0x14*/ s16 tileX; // position of shaking grass
    /*0x16*/ s16 tileY;
    /*0x18*/ u8 spriteIdSpecies;
    /*0x19*/ u8 spriteIdBlackBar[4];
    /*0x1D*/ u8 spriteIdSight;
    /*0x1E*/ u8 spriteIdAbility;
    /*0x1F*/ u8 spriteIdMove;
    /*0x20*/ u8 spriteIdItem;
    /*0x21*/ u8 fldEffSpriteId;
    /*0x22*/ u8 spriteIdPotential[3];
    /*0x25*/ u8 movementTimes;
// GUI data
    /*0x26*/ u16 grassSpecies[NUM_LAND_MONS];
    /*0x3E*/ u16 waterSpecies[NUM_WATER_MONS];
	/*0x48*/ u16 hiddenSpecies[NUM_LAND_MONS + 1];
	/*0x62*/ u8 unownForms[NUM_LAND_MONS];
	/*0x6E*/ u8 unownFormsByDNavIndices[NUM_LAND_MONS];
	/*0x7A*/ u8 numGrassMons;
	/*0x7B*/ u8 numWaterMons;
	/*0x7C*/ u8 numHiddenLandMons;
	/*0x7D*/ u8 numHiddenWaterMons;
    /*0x7E*/ u8 cursorId;
    /*0x7F*/ u8 objids[17];
    /*0x90*/ u8 selectedIndex;
    /*0x91*/ u8 selectedArr;
    /*0x92*/ u8 abilityNum;
    /*0x93*/ u8 filler93;
    /*0x94*/ void* backBuffer;
}; /* size = 0x98 */

// RAM

EWRAM_DATA static u8 sDexNavSearchLevels[NUM_SPECIES] = {0};    // to be moved to saveblock!!!!
EWRAM_DATA static struct DexnavSearch *sDexnavSearchDataPtr = {NULL};  //#define sDexnavSearchDataPtr (*((struct DexnavSearch**) 0x203E038))
EWRAM_DATA u16 gDexnavSpecies = 0;
EWRAM_DATA u8 gDexnavEnvironment = 0;
EWRAM_DATA u8 sDexnavWindowId = 0;
EWRAM_DATA u8 sDexnavSearchSpriteId = 0;

// Function Declarations
static void VblackCallbackSeq(void);
static u8 ExecDexNav(void);
static void DexNavGuiHandler(void);
static void DexNavGuiSetup(void);
static void DexNavPopulateEncounterList(void);
static void DexNavLoadNames(u8 status);
static void DexNavLoadPokeIcons(void);
static void CreateNoDataIcon(s16 x, s16 y);
static void SpawnPointerArrow(void);
static void UpdateCursorPosition(void);
static void DexNavLoadCapturedAllSymbol(void);
static void DexNavGuiExitSearch(void);
static void CallbackDexNavOW(void);
